'''Напишіть програму для аналізу фідбеку від відвідувачів курорту «Морська зірка», яка повинна знаходити
згадки про меню, спортзал, обслуговування. Якщо фідбек перевищив 60 символів, відвідувачу надається
знижка 15% на наступне відвідування'''

feedback = input("Input feedback: ")

my_tuple_1 = "меню", "спортзал", "обслуговування"
my_tuple_2 = "Меню", "Спортзал", "Обслуговування"

if feedback.find(my_tuple_1[0]) >= 0 or feedback.find(my_tuple_2[0]) >= 0:
    print("В фідбеці є згадки про меню")
else:
    print("В фідбеці нема згадок про меню")

if feedback.find(my_tuple_1[1]) >= 0 or feedback.find(my_tuple_2[1]) >= 0:
    print("В фідбеці є згадки про спортзал")
else:
    print("В фідбеці нема згадок про спортзал")

if feedback.find(my_tuple_1[2]) >= 0 or feedback.find(my_tuple_2[2]) >= 0:
    print("В фідбеці є згадки про обслуговування")
else:
    print("В фідбеці нема згадок про обслуговування")

if len(feedback) > 60:
    print("Відвідувачу надається знижка 15% на наступне відвідування")